<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"91a26ac550a2f7627b047ad735af0cec336d8fb0f9f775c259c4a92b96985a9b","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1319 at https://github.com/cal-itp/data-infra/actions/runs/20838072440","plan_out_hash":"a1861d239d650d3344fd35af5220aff2e262ee4d512a1dc8e65051429555aa54","plan_hash":"24eb0e556d2ac5e7cd3419f23b0595eca4aab9291eda19e09dc9e48714c576fd","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "fSyMug==" -> (known after apply)
!~      detect_md5hash      = "LXFQhCCXUHqK/ErVasSLvA==" -> "different hash"
!~      generation          = 1767749389460040 -> (known after apply)
        id                  = "calitp-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "LXFQhCCXUHqK/ErVasSLvA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "aa0zBg==" -> (known after apply)
!~      detect_md5hash      = "DB0rN1eMI6EmyMzB+/Q/0A==" -> "different hash"
!~      generation          = 1765308834177868 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "DB0rN1eMI6EmyMzB+/Q/0A==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1319](https://github.com/cal-itp/data-infra/actions/runs/20838072440)